In [1]:
import pandas as pd
import numpy as np

In [2]:
from google.colab import drive
drive.mount('/content/gdrive')
import os

Mounted at /content/gdrive

In [3]:
path = '/content/gdrive/MyDrive/DatabaseColab'
os.listdir(path)

['transportation_sales.db',
 'narasio_class.db',
 'rexon_metals.db',
 'weather_stations.db',
 'titanic2.csv',
 'iris.csv',
 'avocado.csv',
 'geolocation.csv',
 'titanic.csv',
 'ride_sharing_new.csv',
 'New York Bus Rides.db',
 'CapstoneJDS']

In [6]:
df = pd.read_csv('/content/gdrive/MyDrive/DatabaseColab/titanic.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Check Missing Value

In [7]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Missing Value Percentage

In [8]:
missing_total = df.isna().sum()
missing_count = missing_total.sum()
total_cols = np.product(df.shape)
percentage = (missing_count/total_cols)*100
print(percentage, "%")

8.099513655069211 %

Percentage per Column

In [13]:
missing_total = df['Cabin'].isna().sum()
missing_count = missing_total.sum()
total_cols = np.product(df['Cabin'].shape)
percentage = (missing_count/total_cols)*100
print(percentage, "%")

77.10437710437711 %

Handling with Dropping Row

In [21]:
df_drop = df.copy()
df_drop = df_drop.drop(['Cabin'], axis=1)
df_drop.head()

   PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0            1         0       3  ...         A/5 21171   7.2500         S
1            2         1       1  ...          PC 17599  71.2833         C
2            3         1       3  ...  STON/O2. 3101282   7.9250         S
3            4         1       1  ...            113803  53.1000         S
4            5         0       3  ...            373450   8.0500         S

[5 rows x 11 columns]

Handling with Dropping NaN Value

In [33]:
df_drop_col = df.copy()
df_drop_col = df_drop_col.dropna(axis=0)
df_drop_col.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

Filling the NaN with 0

In [34]:
df_fill = df.copy()
df_fill = df.fillna(0)
df_fill.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

Filling the NaN with Next Value

In [35]:
df_fill = df.copy()
df_fill = df.fillna(method='bfill', axis=0).fillna(0)
df_fill.isna().sum() # bfill can replaced with ffill to Fill NaN with Last Value

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

Filling NaN with mean, medium, or mode

In [36]:
df_fill_m = df.copy()
df_fill_m = df.fillna(df_fill_m.mean())
df_fill_m.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Using Simple Imputer

In [39]:
from sklearn.impute import SimpleImputer

df_imputer = df[['Age']]
my_imputer = SimpleImputer()
imputed_df = pd.DataFrame(my_imputer.fit_transform(df_imputer))
imputed_df.isna().sum()

0    0
dtype: int64